In [7]:
import pandas as pd
import numpy as np

In [9]:
s1=pd.Series(np.arange(4), index=["a","c","d","e"])
s2=pd.Series(np.arange(5), index=["a","c","e","f", "g"])
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [10]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [19]:
df1=pd.DataFrame(np.arange(6).reshape(2,3), index=["Tim", "Tom"], columns=list("ABC"))
df2=pd.DataFrame(np.arange(9).reshape(3,3), index=["Tim","Kate", "Tom"], columns=list("ACD"))
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [20]:
df1+df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [21]:
df1.add(df2, fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [24]:
#division
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [25]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [26]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [27]:
df1*df2

         A   B     C   D
Kate   NaN NaN   NaN NaN
Tim    0.0 NaN   2.0 NaN
Tom   18.0 NaN  35.0 NaN

In [28]:
s=df2.iloc[1]
print(s)

A    3
C    4
D    5
Name: Kate, dtype: int32

In [29]:
df2-s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [34]:
#dataframe bata series ma gayo
s2=df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

In [36]:
df2.sub(s2, axis=0)

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

In [37]:
df=pd.DataFrame(np.random.randn(4,3), index=["Kim", "Susan","Tim", "Tom"], columns=list("ABC"))
df

              A         B         C
Kim    0.261666 -1.344415  0.506663
Susan  0.152568 -0.900106  0.431484
Tim    0.992002  0.274953 -0.510297
Tom    0.455146  0.473628 -0.913361

In [38]:
abs(df)

              A         B         C
Kim    0.261666  1.344415  0.506663
Susan  0.152568  0.900106  0.431484
Tim    0.992002  0.274953  0.510297
Tom    0.455146  0.473628  0.913361

In [43]:
def calculate_range (x):
    return x.max()-x.min()
df.apply(calculate_range)

A    0.839435
B    1.069462
C    0.481877
dtype: float64

In [46]:
#Apply Lambda Function, lambda is a anonymus function
f_Lambda=lambda x: x.max()-x.min()
df.apply(f_Lambda)

A    0.839435
B    1.069462
C    0.481877
dtype: float64

In [47]:
df.apply(f_Lambda,axis=1)

Kim      1.082749
Susan    0.747538
Tim      0.717049
Tom      0.458215
dtype: float64

In [49]:
def f (x):
    return x**2
df.apply(f)

              A         B         C
Kim    0.068469  1.807452  0.256707
Susan  0.023277  0.810190  0.186179
Tim    0.984069  0.075599  0.260403
Tom    0.207158  0.224324  0.834228

In [50]:
f=lambda x: x**2
df.apply(f)

              A         B         C
Kim    0.068469  1.807452  0.256707
Susan  0.023277  0.810190  0.186179
Tim    0.984069  0.075599  0.260403
Tom    0.207158  0.224324  0.834228